In [1]:
import pandas as pd
df=pd.read_csv("./data/car_data.csv")

In [2]:
df.head()

,Car_Name,company,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,maruti suzuki,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,maruti suzuki,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,maruti suzuki,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,maruti suzuki,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,maruti suzuki,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [3]:
df.shape

(301, 10)

In [4]:
current_year=2026
df["car_age"]=current_year-df["Year"]

In [5]:
df.drop(columns=["Year"], inplace=True)

In [6]:
df[["car_age"]].head()

   car_age
0       12
1       13
2        9
3       15
4       12

In [7]:
df.drop(columns=["Car_Name"], inplace=True)

In [8]:
df.columns

Index(['company', 'Selling_Price', 'Present_Price', 'Kms_Driven', 'Fuel_Type',
       'Seller_Type', 'Transmission', 'Owner', 'car_age'],
      dtype='object')

In [9]:
categorical_cols=["Fuel_Type", "Transmission", "Seller_Type"]

df=pd.get_dummies(
    df,
    columns=categorical_cols,
    drop_first=True
)

In [10]:
df.columns

Index(['company', 'Selling_Price', 'Present_Price', 'Kms_Driven', 'Owner',
       'car_age', 'Fuel_Type_Diesel', 'Fuel_Type_Petrol',
       'Transmission_Manual', 'Seller_Type_Individual'],
      dtype='object')

In [11]:
df['company'].value_counts()

company
honda            70
maruti suzuki    50
hyndai           50
other            39
toyota           36
bajaj            25
hero             15
yamaha            8
tvs               8
Name: count, dtype: int64

In [12]:
top_brands=df["company"].value_counts().head(5).index
top_brands

Index(['honda', 'maruti suzuki', 'hyndai', 'other', 'toyota'], dtype='object', name='company')

In [13]:
df["company_grouped"]=df["company"].where(
    df["company"].isin(top_brands),
    "Other"
)

In [14]:
df=pd.get_dummies(
    df,
    columns=["company_grouped"],
    drop_first=True
)

In [15]:
df.drop(columns=["company"], inplace=True)

In [16]:
df.select_dtypes(include="object")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[301 rows x 0 columns]